IDEA StatiCa Open Model
ReferenceElement Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Reference element class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.ReferenceElement
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ReferenceElement
Public Class ReferenceElement
public ref class ReferenceElement
The ReferenceElement type exposes the following members.
Constructors
Name | Description
ReferenceElement()
 Constructor
ReferenceElement(OpenElementId)
 Constructor
Top
Properties
Name | Description
Element
 Referenced element
Id
 Element Id
TypeName
 Element type name
Top
See Also
Reference
IdeaRS.OpenModel Namespace